{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[SOS]": 1,
      "[EOS]": 2,
      "[PAD]": 3,
      "!": 4,
      "\"": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "=": 29,
      "?": 30,
      "_": 31,
      "`": 32,
      "a": 33,
      "b": 34,
      "c": 35,
      "d": 36,
      "e": 37,
      "f": 38,
      "g": 39,
      "h": 40,
      "i": 41,
      "j": 42,
      "k": 43,
      "l": 44,
      "m": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "q": 49,
      "r": 50,
      "s": 51,
      "t": 52,
      "u": 53,
      "v": 54,
      "w": 55,
      "x": 56,
      "y": 57,
      "z": 58,
      "£": 59,
      "¦": 60,
      "æ": 61,
      "è": 62,
      "ˆ": 63,
      "—": 64,
      "“": 65,
      "‹": 66,
      "##m": 67,
      "##p": 68,
      "##a": 69,
      "##c": 70,
      "##t": 71,
      "##o": 72,
      "##8": 73,
      "##5": 74,
      "##r": 75,
      "##u": 76,
      "##i": 77,
      "##n": 78,
      "##v": 79,
      "##e": 80,
      "##s": 81,
      "##l": 82,
      "##4": 83,
      "##3": 84,
      "##2": 85,
      "##w": 86,
      "##1": 87,
      "##6": 88,
      "##9": 89,
      "##y": 90,
      "##7": 91,
      "##h": 92,
      "##g": 93,
      "##0": 94,
      "##b": 95,
      "##x": 96,
      "##d": 97,
      "##k": 98,
      "##f": 99,
      "##z": 100,
      "##q": 101,
      "##—": 102,
      "##j": 103,
      "##\"": 104,
      "##'": 105,
      "##(": 106,
      "##-": 107,
      "##+": 108,
      "##`": 109,
      "##:": 110,
      "##“": 111,
      "##.": 112,
      "##‹": 113,
      "##¦": 114,
      "##£": 115,
      "##,": 116,
      "##er": 117,
      "th": 118,
      "##in": 119,
      "the": 120,
      "##on": 121,
      "##es": 122,
      "##an": 123,
      "in": 124,
      "##or": 125,
      "##ar": 126,
      "##en": 127,
      "##ed": 128,
      "##at": 129,
      "##al": 130,
      "##ro": 131,
      "of": 132,
      "an": 133,
      "##ion": 134,
      "##ing": 135,
      "to": 136,
      "##it": 137,
      "##ur": 138,
      "##il": 139,
      ",\"": 140,
      ".\"": 141,
      "and": 142,
      "##om": 143,
      "##as": 144,
      "##is": 145,
      "##ct": 146,
      "##ic": 147,
      "##el": 148,
      "##ent": 149,
      "##et": 150,
      "20": 151,
      "com": 152,
      "##st": 153,
      "##re": 154,
      "##ill": 155,
      "pro": 156,
      "##id": 157,
      "comp": 158,
      "for": 159,
      "eur": 160,
      "it": 161,
      "##ec": 162,
      "##ut": 163,
      "##ol": 164,
      "st": 165,
      "fin": 166,
      "##ation": 167,
      "is": 168,
      "200": 169,
      "##em": 170,
      "compan": 171,
      "##ers": 172,
      "##un": 173,
      "be": 174,
      "on": 175,
      "##iv": 176,
      "##and": 177,
      "con": 178,
      "will": 179,
      "sa": 180,
      "##us": 181,
      "company": 182,
      "##per": 183,
      "##est": 184,
      "##ir": 185,
      "##ish": 186,
      "##le": 187,
      "as": 188,
      "re": 189,
      "##ig": 190,
      "##ter": 191,
      "##ad": 192,
      "##th": 193,
      "##ch": 194,
      "##os": 195,
      "sh": 196,
      "##ul": 197,
      "##ia": 198,
      "##rom": 199,
      "##ith": 200,
      "##ay": 201,
      "##ment": 202,
      "from": 203,
      "##ess": 204,
      "with": 205,
      "has": 206,
      "its": 207,
      "ex": 208,
      "##uct": 209,
      "al": 210,
      "##up": 211,
      "inc": 212,
      "##im": 213,
      "##ra": 214,
      "##ce": 215,
      "##ect": 216,
      "##por": 217,
      "##ly": 218,
      "ne": 219,
      "mar": 220,
      "##ies": 221,
      "##ot": 222,
      "finn": 223,
      "said": 224,
      "##are": 225,
      "by": 226,
      "sal": 227,
      "at": 228,
      "##od": 229,
      "en": 230,
      "##ding": 231,
      "finnish": 232,
      "per": 233,
      "de": 234,
      "net": 235,
      "pl": 236,
      "gro": 237,
      "ma": 238,
      "##ow": 239,
      "##00": 240,
      "##ear": 241,
      "##illion": 242,
      "##um": 243,
      "wh": 244,
      "oper": 245,
      "##ap": 246,
      "##ity": 247,
      "##ust": 248,
      "##ver": 249,
      "##qu": 250,
      "##ial": 251,
      "that": 252,
      "##vic": 253,
      "##oc": 254,
      "sales": 255,
      "ac": 256,
      "ser": 257,
      "##op": 258,
      "million": 259,
      "##pl": 260,
      "##land": 261,
      "year": 262,
      "##ate": 263,
      "cont": 264,
      "##ts": 265,
      "##ab": 266,
      "prod": 267,
      "new": 268,
      "co": 269,
      "##ket": 270,
      "ch": 271,
      "201": 272,
      "pr": 273,
      "##ement": 274,
      "cor": 275,
      "##art": 276,
      "servic": 277,
      "finland": 278,
      "us": 279,
      "##ag": 280,
      "##ip": 281,
      "or": 282,
      "un": 283,
      "are": 284,
      "market": 285,
      "group": 286,
      "mn": 287,
      "##av": 288,
      "##ber": 289,
      "man": 290,
      "##am": 291,
      "##ac": 292,
      "##uar": 293,
      "##ine": 294,
      "##ok": 295,
      "ap": 296,
      "hel": 297,
      "was": 298,
      "##ub": 299,
      "##so": 300,
      "eu": 301,
      "product": 302,
      "prof": 303,
      "##ist": 304,
      "##ations": 305,
      "10": 306,
      "##ased": 307,
      "##ated": 308,
      "euro": 309,
      "oy": 310,
      "##ran": 311,
      "19": 312,
      "inv": 313,
      "##ating": 314,
      "bus": 315,
      "##ki": 316,
      "##ell": 317,
      "profit": 318,
      "##iness": 319,
      "##ain": 320,
      "##act": 321,
      "business": 322,
      "se": 323,
      "15": 324,
      "##ions": 325,
      "up": 326,
      "##der": 327,
      "14": 328,
      "##ase": 329,
      "##ue": 330,
      "share": 331,
      "##ign": 332,
      "12": 333,
      "##oun": 334,
      "13": 335,
      "##ant": 336,
      "##ive": 337,
      "##ard": 338,
      "##vel": 339,
      "##out": 340,
      "res": 341,
      "##og": 342,
      "##ln": 343,
      "incre": 344,
      "##port": 345,
      "##ech": 346,
      "##igh": 347,
      "11": 348,
      "##ri": 349,
      "2009": 350,
      "##ob": 351,
      "25": 352,
      "ab": 353,
      "mln": 354,
      "##ich": 355,
      "ind": 356,
      "##all": 357,
      "ag": 358,
      "##ast": 359,
      "exp": 360,
      "##day": 361,
      "##ore": 362,
      "##arg": 363,
      "16": 364,
      "bu": 365,
      "invest": 366,
      "cap": 367,
      "18": 368,
      "23": 369,
      "2010": 370,
      "22": 371,
      "services": 372,
      "bo": 373,
      "17": 374,
      "sol": 375,
      "##ak": 376,
      "off": 377,
      "##if": 378,
      "also": 379,
      "##ave": 380,
      "24": 381,
      "##ruct": 382,
      "000": 383,
      "##ere": 384,
      "21": 385,
      "26": 386,
      "27": 387,
      "##ract": 388,
      "ad": 389,
      "which": 390,
      "nor": 391,
      "2008": 392,
      "##ank": 393,
      "tech": 394,
      "tot": 395,
      "##ther": 396,
      "devel": 397,
      "operating": 398,
      "est": 399,
      "wor": 400,
      "##ov": 401,
      "##ure": 402,
      "##pt": 403,
      "##ge": 404,
      "2007": 405,
      "acc": 406,
      "techn": 407,
      "have": 408,
      "le": 409,
      "##oy": 410,
      "##ire": 411,
      "##iod": 412,
      "##anc": 413,
      "''": 414,
      "##ud": 415,
      "##ile": 416,
      "we": 417,
      "oyj": 418,
      "he": 419,
      "quar": 420,
      "##pro": 421,
      "contract": 422,
      "quarter": 423,
      "sp": 424,
      "##res": 425,
      "this": 426,
      "##ors": 427,
      "ann": 428,
      "period": 429,
      "##ose": 430,
      "fir": 431,
      "incl": 432,
      "develop": 433,
      "am": 434,
      "part": 435,
      "int": 436,
      "##ares": 437,
      "##ome": 438,
      "corpor": 439,
      "##ail": 440,
      "##ical": 441,
      "total": 442,
      "##ice": 443,
      "out": 444,
      "##ug": 445,
      "##ual": 446,
      "shares": 447,
      "##ition": 448,
      "me": 449,
      "tel": 450,
      "##ond": 451,
      "2006": 452,
      "##ry": 453,
      "sup": 454,
      "comm": 455,
      "##olog": 456,
      "financ": 457,
      "rec": 458,
      "sec": 459,
      "##ost": 460,
      "##ance": 461,
      "prov": 462,
      "agre": 463,
      "bank": 464,
      "sy": 465,
      "##ks": 466,
      "##end": 467,
      "##ff": 468,
      "been": 469,
      "acqu": 470,
      "##our": 471,
      "##ember": 472,
      "##able": 473,
      "about": 474,
      "##io": 475,
      "buil": 476,
      "em": 477,
      "##ens": 478,
      "unit": 479,
      "technolog": 480,
      "rel": 481,
      "inter": 482,
      "##fact": 483,
      "str": 484,
      "solut": 485,
      "cust": 486,
      "met": 487,
      "##``": 488,
      "provid": 489,
      "custom": 490,
      "br": 491,
      "##ject": 492,
      "##ely": 493,
      "indust": 494,
      "corporation": 495,
      "nok": 496,
      "su": 497,
      "##ufact": 498,
      "manufact": 499,
      "hels": 500,
      "##ult": 501,
      "manag": 502,
      "sub": 503,
      "##wn": 504,
      "##inki": 505,
      "cons": 506,
      "first": 507,
      "helsinki": 508,
      "sign": 509,
      "investment": 510,
      "financial": 511,
      "im": 512,
      "mak": 513,
      "val": 514,
      "##ware": 515,
      "##ange": 516,
      "expect": 517,
      "##man": 518,
      "##ploy": 519,
      "ph": 520,
      "tran": 521,
      "##ood": 522,
      "##ian": 523,
      "##one": 524,
      "##ong": 525,
      "##uss": 526,
      "appro": 527,
      "trans": 528,
      "based": 529,
      "mob": 530,
      "##ik": 531,
      "##struct": 532,
      "##und": 533,
      "accor": 534,
      "cl": 535,
      "gl": 536,
      "##ital": 537,
      "project": 538,
      "##ock": 539,
      "##se": 540,
      "##int": 541,
      "today": 542,
      "pa": 543,
      "##pon": 544,
      "##uring": 545,
      "construct": 546,
      "plan": 547,
      "employ": 548,
      "nokia": 549,
      "ele": 550,
      "not": 551,
      "##cent": 552,
      "all": 553,
      "del": 554,
      "well": 555,
      "##ft": 556,
      "##for": 557,
      "report": 558,
      "##uary": 559,
      "##ility": 560,
      "##stem": 561,
      "order": 562,
      "technology": 563,
      "mon": 564,
      "own": 565,
      "were": 566,
      "##ib": 567,
      "system": 568,
      "mobile": 569,
      "cent": 570,
      "ear": 571,
      "tr": 572,
      "##ced": 573,
      "stock": 574,
      "##ubl": 575,
      "products": 576,
      "includ": 577,
      "over": 578,
      "ra": 579,
      "russ": 580,
      "##ek": 581,
      "production": 582,
      "##rib": 583,
      "sw": 584,
      "##ier": 585,
      "operations": 586,
      "service": 587,
      "according": 588,
      "construction": 589,
      "div": 590,
      "equ": 591,
      "other": 592,
      "deliv": 593,
      "af": 594,
      "dec": 595,
      "tw": 596,
      "##ace": 597,
      "increased": 598,
      "increase": 599,
      "nord": 600,
      "agreement": 601,
      "30": 602,
      "dire": 603,
      "pre": 604,
      "##ning": 605,
      "##ld": 606,
      "##wor": 607,
      "##ary": 608,
      "##uld": 609,
      "plant": 610,
      "direct": 611,
      "so": 612,
      "##ities": 613,
      "reg": 614,
      "percent": 615,
      "##ake": 616,
      "subs": 617,
      "deliver": 618,
      "##iz": 619,
      "##ates": 620,
      "elect": 621,
      "##form": 622,
      "##cess": 623,
      "sam": 624,
      "##ade": 625,
      "des": 626,
      "fe": 627,
      "companies": 628,
      "##oss": 629,
      "rose": 630,
      "##ater": 631,
      "##isc": 632,
      "compar": 633,
      "capital": 634,
      "hand": 635,
      "##ven": 636,
      "##ys": 637,
      "##xim": 638,
      "##ener": 639,
      "##oll": 640,
      "corres": 641,
      "jan": 642,
      "##eo": 643,
      "##ata": 644,
      "##ise": 645,
      "##ount": 646,
      "##ugh": 647,
      "solutions": 648,
      "value": 649,
      "our": 650,
      "dist": 651,
      "sc": 652,
      "##po": 653,
      "##ron": 654,
      "##ics": 655,
      "end": 656,
      "usd": 657,
      "add": 658,
      "##ponding": 659,
      "two": 660,
      "corresponding": 661,
      "high": 662,
      "loc": 663,
      "##ould": 664,
      "eur1": 665,
      "2005": 666,
      "building": 667,
      "##ders": 668,
      "##etail": 669,
      "one": 670,
      "networ": 671,
      "##ipment": 672,
      "customers": 673,
      "month": 674,
      "design": 675,
      "loss": 676,
      "more": 677,
      "some": 678,
      "##uk": 679,
      "##ie": 680,
      "##1v": 681,
      "##hol": 682,
      "##fer": 683,
      "than": 684,
      "##ence": 685,
      "under": 686,
      "compared": 687,
      "act": 688,
      "larg": 689,
      "med": 690,
      "tur": 691,
      "##erm": 692,
      "their": 693,
      "##ark": 694,
      "real": 695,
      "board": 696,
      "announ": 697,
      "gener": 698,
      "publ": 699,
      "##mn": 700,
      "eng": 701,
      "annual": 702,
      "##ribut": 703,
      "swed": 704,
      "equipment": 705,
      "can": 706,
      "##ward": 707,
      "##ines": 708,
      "##ene": 709,
      "##ately": 710,
      "##urr": 711,
      "start": 712,
      "deal": 713,
      "grow": 714,
      "head": 715,
      "##pe": 716,
      "##ering": 717,
      "##arm": 718,
      "##ures": 719,
      "##ass": 720,
      "into": 721,
      "second": 722,
      "##over": 723,
      "##ort": 724,
      "##ight": 725,
      "lead": 726,
      "development": 727,
      "russia": 728,
      "##ries": 729,
      "##let": 730,
      "##ko": 731,
      "process": 732,
      "##ram": 733,
      "pres": 734,
      "fac": 735,
      "would": 736,
      "##ka": 737,
      "##enc": 738,
      "##unt": 739,
      "##unic": 740,
      "2011": 741,
      "markets": 742,
      "acquis": 743,
      "january": 744,
      "tim": 745,
      "term": 746,
      "##ous": 747,
      "##ery": 748,
      ",\"``": 749,
      "ste": 750,
      "ass": 751,
      "##abl": 752,
      "industry": 753,
      "expected": 754,
      "approxim": 755,
      "soft": 756,
      "approximately": 757,
      "50": 758,
      "car": 759,
      "##ah": 760,
      "##gy": 761,
      "##ite": 762,
      "sept": 763,
      "glob": 764,
      "paper": 765,
      "last": 766,
      "tra": 767,
      "##ator": 768,
      "##ational": 769,
      "distribut": 770,
      "curr": 771,
      "po": 772,
      "pct": 773,
      "##50": 774,
      "##ix": 775,
      "##ecom": 776,
      "estim": 777,
      "work": 778,
      "signed": 779,
      "``": 780,
      "disc": 781,
      "el": 782,
      "mod": 783,
      "sell": 784,
      "##ric": 785,
      "##20": 786,
      "anal": 787,
      "##ision": 788,
      "plc": 789,
      "employe": 790,
      "after": 791,
      "software": 792,
      "global": 793,
      "bas": 794,
      "data": 795,
      "may": 796,
      "pe": 797,
      "##ach": 798,
      "thir": 799,
      "##ons": 800,
      "##ree": 801,
      "complet": 802,
      "news": 803,
      "maker": 804,
      "september": 805,
      ",``": 806,
      "ar": 807,
      "aut": 808,
      "ceo": 809,
      "lt": 810,
      "num": 811,
      "pos": 812,
      "##ax": 813,
      "##onn": 814,
      "##ans": 815,
      "inst": 816,
      "##tered": 817,
      "##change": 818,
      "##osed": 819,
      "##ports": 820,
      "contin": 821,
      "price": 822,
      "##age": 823,
      "world": 824,
      "35": 825,
      "eff": 826,
      "ka": 827,
      "no": 828,
      "##ve": 829,
      "##ved": 830,
      "##60": 831,
      "##eng": 832,
      "exchange": 833,
      "count": 834,
      "##ack": 835,
      "##ific": 836,
      "rele": 837,
      "management": 838,
      "announced": 839,
      "third": 840,
      "100": 841,
      "do": 842,
      "om": 843,
      "op": 844,
      "oct": 845,
      "opt": 846,
      "rem": 847,
      "va": 848,
      "##ina": 849,
      "rep": 850,
      "mach": 851,
      "##own": 852,
      "buy": 853,
      "intern": 854,
      "current": 855,
      "employees": 856,
      "fur": 857,
      "lo": 858,
      "line": 859,
      "##ps": 860,
      "##te": 861,
      "##ars": 862,
      "##ide": 863,
      "##ower": 864,
      "euros": 865,
      "both": 866,
      "suppl": 867,
      "brand": 868,
      "electron": 869,
      "media": 870,
      "engine": 871,
      "acquisition": 872,
      "omx": 873,
      "hol": 874,
      "how": 875,
      "pers": 876,
      "te": 877,
      "##ply": 878,
      "##oper": 879,
      "##inen": 880,
      "##pert": 881,
      "area": 882,
      "number": 883,
      "29": 884,
      "av": 885,
      "pur": 886,
      "sect": 887,
      "##30": 888,
      "##we": 889,
      "##ink": 890,
      "##rough": 891,
      "stor": 892,
      "iss": 893,
      "europe": 894,
      "systems": 895,
      "largest": 896,
      "ltd": 897,
      "--": 898,
      "la": 899,
      "long": 900,
      "most": 901,
      "##uding": 902,
      "##gin": 903,
      "##fore": 904,
      "##ila": 905,
      "##ident": 906,
      "##ola": 907,
      "stake": 908,
      "reven": 909,
      "produ": 910,
      "appl": 911,
      "result": 912,
      "##ights": 913,
      "amount": 914,
      "strate": 915,
      "earl": 916,
      "billion": 917,
      "ful": 918,
      "four": 919,
      "fund": 920,
      "had": 921,
      "nov": 922,
      "##xt": 923,
      "##ang": 924,
      "##ala": 925,
      "##ecial": 926,
      "supply": 927,
      "growth": 928,
      "steel": 929,
      "40": 930,
      "bet": 931,
      "foc": 932,
      "##uuk": 933,
      "##ling": 934,
      "through": 935,
      "inform": 936,
      "##rol": 937,
      "##idi": 938,
      "##lex": 939,
      "devic": 940,
      "sharehol": 941,
      "including": 942,
      "telecom": 943,
      "manufacturing": 944,
      "nordic": 945,
      "focus": 946,
      "carg": 947,
      "es": 948,
      "made": 949,
      "port": 950,
      "##ma": 951,
      "##80": 952,
      "##la": 953,
      "##br": 954,
      "##ady": 955,
      "##ople": 956,
      "capac": 957,
      "amer": 958,
      "meas": 959,
      "subsc": 960,
      "turn": 961,
      "publish": 962,
      "people": 963,
      "earlier": 964,
      "##uukki": 965,
      "award": 966,
      "lif": 967,
      "san": 968,
      "targ": 969,
      "##air": 970,
      "##65": 971,
      "they": 972,
      "##urg": 973,
      "##els": 974,
      "##otec": 975,
      "impro": 976,
      "transact": 977,
      "network": 978,
      "months": 979,
      "time": 980,
      "release": 981,
      "engineering": 982,
      "target": 983,
      "aim": 984,
      "cr": 985,
      "foll": 986,
      "jun": 987,
      "now": 988,
      "##ober": 989,
      "##ril": 990,
      "##ued": 991,
      "##ey": 992,
      "##40": 993,
      "##25": 994,
      "##10": 995,
      "##73": 996,
      "##her": 997,
      "##gan": 998,
      "##alt": 999,
      "##ents": 1000,
      "use": 1001,
      "expand": 1002,
      "communic": 1003,
      "acquir": 1004,
      "manufactur": 1005,
      "consum": 1006,
      "pharm": 1007,
      "includes": 1008,
      "subsidi": 1009,
      "same": 1010,
      "october": 1011,
      "information": 1012,
      "capacity": 1013,
      "retail": 1014,
      "sm": 1015,
      "##85": 1016,
      "##ria": 1017,
      "##ues": 1018,
      "##ea": 1019,
      "##ever": 1020,
      "##49": 1021,
      "##29": 1022,
      "##97": 1023,
      "##70": 1024,
      "these": 1025,
      "##ory": 1026,
      "##ives": 1027,
      "while": 1028,
      "years": 1029,
      "cost": 1030,
      "april": 1031,
      "partn": 1032,
      "##ious": 1033,
      "solution": 1034,
      "estimated": 1035,
      "countries": 1036,
      "further": 1037,
      "applic": 1038,
      "follow": 1039,
      "70": 1040,
      "mater": 1041,
      "red": 1042,
      "##83": 1043,
      "##ral": 1044,
      "##45": 1045,
      "##34": 1046,
      "##32": 1047,
      "##98": 1048,
      "##hip": 1049,
      "##gr": 1050,
      "##da": 1051,
      "##ative": 1052,
      "##ments": 1053,
      "march": 1054,
      "##ame": 1055,
      "agreed": 1056,
      "distribution": 1057,
      "however": 1058,
      "material": 1059,
      "60": 1060,
      "ah": 1061,
      "day": 1062,
      "gre": 1063,
      "rights": 1064,
      "tal": 1065,
      "vol": 1066,
      "##con": 1067,
      "##88": 1068,
      "##line": 1069,
      "##23": 1070,
      "##12": 1071,
      "##62": 1072,
      "ins": 1073,
      "##round": 1074,
      "##iss": 1075,
      "##utical": 1076,
      "##este": 1077,
      "ent": 1078,
      "main": 1079,
      "china": 1080,
      "capman": 1081,
      "establ": 1082,
      "expects": 1083,
      "##ible": 1084,
      "divid": 1085,
      "##aceutical": 1086,
      "facility": 1087,
      "discl": 1088,
      "remain": 1089,
      "purch": 1090,
      "establish": 1091,
      "bro": 1092,
      "fl": 1093,
      "lat": 1094,
      "pat": 1095,
      "ty": 1096,
      "##ping": 1097,
      "##82": 1098,
      "##86": 1099,
      "##89": 1100,
      "##87": 1101,
      "##59": 1102,
      "##ving": 1103,
      "##42": 1104,
      "##41": 1105,
      "##31": 1106,
      "##28": 1107,
      "##63": 1108,
      "##61": 1109,
      "##75": 1110,
      "##71": 1111,
      "propert": 1112,
      "form": 1113,
      "eur0": 1114,
      "stat": 1115,
      "struct": 1116,
      "##unch": 1117,
      "##ote": 1118,
      "control": 1119,
      "developed": 1120,
      "secur": 1121,
      "interest": 1122,
      "signific": 1123,
      "headqu": 1124,
      "basware": 1125,
      "##ween": 1126,
      "between": 1127,
      "americ": 1128,
      "pharmaceutical": 1129,
      "around": 1130,
      "dr": 1131,
      "dig": 1132,
      "during": 1133,
      "jo": 1134,
      "power": 1135,
      "sin": 1136,
      "sch": 1137,
      "won": 1138,
      "yit": 1139,
      "##ti": 1140,
      "##na": 1141,
      "##43": 1142,
      "##21": 1143,
      "##64": 1144,
      "##91": 1145,
      "##90": 1146,
      "##72": 1147,
      "##77": 1148,
      "##burg": 1149,
      "##inery": 1150,
      "##isk": 1151,
      "##ices": 1152,
      "##ready": 1153,
      "says": 1154,
      "already": 1155,
      "dep": 1156,
      "office": 1157,
      "estate": 1158,
      "special": 1159,
      "rece": 1160,
      "customer": 1161,
      "include": 1162,
      "nordea": 1163,
      "director": 1164,
      "sweden": 1165,
      "##ouse": 1166,
      "revenue": 1167,
      "june": 1168,
      "significant": 1169,
      "city": 1170,
      "min": 1171,
      "mill": 1172,
      "nine": 1173,
      "pet": 1174,
      "pol": 1175,
      "sout": 1176,
      "##rial": 1177,
      "##46": 1178,
      "##35": 1179,
      "##39": 1180,
      "##24": 1181,
      "##27": 1182,
      "##14": 1183,
      "##11": 1184,
      "##66": 1185,
      "##67": 1186,
      "##76": 1187,
      "##jor": 1188,
      "##erc": 1189,
      "three": 1190,
      "##omp": 1191,
      "prop": 1192,
      "before": 1193,
      "ext": 1194,
      "units": 1195,
      "industrial": 1196,
      "trad": 1197,
      "handling": 1198,
      "addition": 1199,
      "poh": 1200,
      "launch": 1201,
      "november": 1202,
      "awarded": 1203,
      "transaction": 1204,
      "80": 1205,
      "detail": 1206,
      "fr": 1207,
      "gr": 1208,
      "jul": 1209,
      "##84": 1210,
      "##58": 1211,
      "##55": 1212,
      "##54": 1213,
      "##53": 1214,
      "##44": 1215,
      "##38": 1216,
      "##33": 1217,
      "##26": 1218,
      "##16": 1219,
      "##94": 1220,
      "##92": 1221,
      "##99": 1222,
      "##78": 1223,
      "##74": 1224,
      "##79": 1225,
      "##got": 1226,
      "##gram": 1227,
      "##ason": 1228,
      "##ets": 1229,
      "program": 1230,
      "compet": 1231,
      "negot": 1232,
      "sale": 1233,
      "major": 1234,
      "##earch": 1235,
      "corp": 1236,
      "orders": 1237,
      "##ound": 1238,
      "offer": 1239,
      "worth": 1240,
      "transfer": 1241,
      "reported": 1242,
      "activ": 1243,
      "swedish": 1244,
      "president": 1245,
      "##ength": 1246,
      "avail": 1247,
      "dividend": 1248,
      "negoti": 1249,
      "air": 1250,
      "kn": 1251,
      "lem": 1252,
      "non": 1253,
      "oil": 1254,
      "pay": 1255,
      "sl": 1256,
      "sum": 1257,
      "take": 1258,
      "##to": 1259,
      "##81": 1260,
      "##56": 1261,
      "##47": 1262,
      "##36": 1263,
      "##22": 1264,
      "##way": 1265,
      "##15": 1266,
      "##19": 1267,
      "##68": 1268,
      "##69": 1269,
      "##95": 1270,
      "##93": 1271,
      "##ind": 1272,
      "##artered": 1273,
      "##itions": 1274,
      "##omen": 1275,
      "##ash": 1276,
      "##strom": 1277,
      "compon": 1278,
      "forest": 1279,
      "##ester": 1280,
      "next": 1281,
      "maint": 1282,
      "cooper": 1283,
      "chain": 1284,
      "##alled": 1285,
      "north": 1286,
      "meet": 1287,
      "related": 1288,
      "strength": 1289,
      "projects": 1290,
      "plans": 1291,
      "prev": 1292,
      "region": 1293,
      "febr": 1294,
      "leading": 1295,
      "carri": 1296,
      "international": 1297,
      "supplier": 1298,
      "electronics": 1299,
      "sanom": 1300,
      "subsidiary": 1301,
      "volum": 1302,
      "july": 1303,
      "available": 1304,
      "february": 1305,
      "fun": 1306,
      "food": 1307,
      "good": 1308,
      "lay": 1309,
      "log": 1310,
      "##pect": 1311,
      "##52": 1312,
      "##51": 1313,
      "##57": 1314,
      "##48": 1315,
      "##37": 1316,
      "##18": 1317,
      "##13": 1318,
      "##17": 1319,
      "##96": 1320,
      "##era": 1321,
      "##ined": 1322,
      "##ised": 1323,
      "env": 1324,
      "where": 1325,
      "##ements": 1326,
      "firm": 1327,
      "local": 1328,
      "networks": 1329,
      "##ency": 1330,
      "analys": 1331,
      "open": 1332,
      "option": 1333,
      "repres": 1334,
      "strategy": 1335,
      "manufacturer": 1336,
      "ahl": 1337,
      "previous": 1338,
      "aug": 1339,
      "bec": 1340,
      "balt": 1341,
      "ky": 1342,
      "lit": 1343,
      "post": 1344,
      "ruukki": 1345,
      "sit": 1346,
      "##ped": 1347,
      "##ium": 1348,
      "##ex": 1349,
      "##ga": 1350,
      "##ergy": 1351,
      "##ones": 1352,
      "##ord": 1353,
      "##edit": 1354,
      "##iron": 1355,
      "whol": 1356,
      "press": 1357,
      "used": 1358,
      "##ove": 1359,
      "web": 1360,
      "strong": 1361,
      "provide": 1362,
      "autom": 1363,
      "issue": 1364,
      "produc": 1365,
      "shareholders": 1366,
      "credit": 1367,
      "pohj": 1368,
      "ahlstrom": 1369,
      "down": 1370,
      "ev": 1371,
      "fran": 1372,
      "fisk": 1373,
      "key": 1374,
      "mat": 1375,
      "ro": 1376,
      "tax": 1377,
      "via": 1378,
      "##ph": 1379,
      "##uit": 1380,
      "##vi": 1381,
      "##yst": 1382,
      "##bers": 1383,
      "##ja": 1384,
      "there": 1385,
      "##ators": 1386,
      "##itive": 1387,
      "##ilities": 1388,
      "##ecut": 1389,
      "ship": 1390,
      "alma": 1391,
      "##ranes": 1392,
      "provider": 1393,
      "center": 1394,
      "central": 1395,
      "earning": 1396,
      "raut": 1397,
      "machinery": 1398,
      "following": 1399,
      "headquartered": 1400,
      "since": 1401,
      "peters": 1402,
      "environ": 1403,
      "represent": 1404,
      "fiskars": 1405,
      "90": 1406,
      "gover": 1407,
      "li": 1408,
      "list": 1409,
      "poy": 1410,
      "range": 1411,
      "six": 1412,
      "uk": 1413,
      "##cl": 1414,
      "##ration": 1415,
      "##ience": 1416,
      "##iason": 1417,
      "##ining": 1418,
      "inf": 1419,
      "##ari": 1420,
      "##urs": 1421,
      "##ily": 1422,
      "store": 1423,
      "2004": 1424,
      "##ively": 1425,
      "ref": 1426,
      "energy": 1427,
      "when": 1428,
      "cover": 1429,
      "##ama": 1430,
      "##ainen": 1431,
      "research": 1432,
      "teliason": 1433,
      "commit": 1434,
      "such": 1435,
      "phone": 1436,
      "trade": 1437,
      "division": 1438,
      "regis": 1439,
      "added": 1440,
      "completed": 1441,
      "position": 1442,
      "currently": 1443,
      "sector": 1444,
      "cargotec": 1445,
      "communications": 1446,
      "meeting": 1447,
      "august": 1448,
      "earnings": 1449,
      "petersburg": 1450,
      "govern": 1451,
      "teliasonera": 1452,
      "aff": 1453,
      "bel": 1454,
      "cre": 1455,
      "cash": 1456,
      "dem": 1457,
      "mer": 1458,
      "mid": 1459,
      "mem": 1460,
      "pul": 1461,
      "qu": 1462,
      "tik": 1463,
      "ww": 1464,
      "##pr": 1465,
      "##cote": 1466,
      "##ied": 1467,
      "##vers": 1468,
      "##ha": 1469,
      "##als": 1470,
      "##aster": 1471,
      "##ction": 1472,
      "comb": 1473,
      "##iday": 1474,
      "##ership": 1475,
      "shop": 1476,
      "execut": 1477,
      "##aging": 1478,
      "marketing": 1479,
      "eston": 1480,
      "support": 1481,
      "commerc": 1482,
      "metso": 1483,
      "owned": 1484,
      "russian": 1485,
      "directors": 1486,
      "sampo": 1487,
      "##iew": 1488,
      "general": 1489,
      "elcote": 1490,
      "##onnel": 1491,
      "install": 1492,
      "effect": 1493,
      "holding": 1494,
      "personnel": 1495,
      "acquired": 1496,
      "security": 1497,
      "america": 1498,
      "analysis": 1499,
      "baltic": 1500,
      "commercial": 1501,
      "elcoteq": 1502,
      "bene": 1503,
      "eb": 1504,
      "eps": 1505,
      "fi": 1506,
      "fut": 1507,
      "go": 1508,
      "ger": 1509,
      "pan": 1510,
      "pack": 1511,
      "qual": 1512,
      "rest": 1513,
      "tonn": 1514,
      "vot": 1515,
      "##mink": 1516,
      "##oice": 1517,
      "##uan": 1518,
      "##uation": 1519,
      "##va": 1520,
      "##ss": 1521,
      "##sh": 1522,
      "##ert": 1523,
      "##ara": 1524,
      "##enance": 1525,
      "##alf": 1526,
      "##urance": 1527,
      "##ising": 1528,
      "##ici": 1529,
      "state": 1530,
      "begin": 1531,
      "##ived": 1532,
      "##lear": 1533,
      "asp": 1534,
      "##ular": 1535,
      "##ults": 1536,
      "exper": 1537,
      "##ection": 1538,
      "charg": 1539,
      "##istics": 1540,
      "150": 1541,
      "results": 1542,
      "contracts": 1543,
      "totaled": 1544,
      "##ffic": 1545,
      "built": 1546,
      "provides": 1547,
      "##ized": 1548,
      "traffic": 1549,
      "analyst": 1550,
      "full": 1551,
      "turnover": 1552,
      "materials": 1553,
      "grew": 1554,
      "purchase": 1555,
      "broad": 1556,
      "south": 1557,
      "details": 1558,
      "negotiations": 1559,
      "component": 1560,
      "maintenance": 1561,
      "strengthen": 1562,
      "pohjola": 1563,
      "poyry": 1564,
      "government": 1565,
      "www": 1566,
      "quality": 1567,
      "00": 1568,
      "due": 1569,
      "kem": 1570,
      "park": 1571,
      "rap": 1572,
      "tec": 1573,
      "wed": 1574,
      "water": 1575,
      "##pa": 1576,
      "##rip": 1577,
      "##nes": 1578,
      "##ned": 1579,
      "##ker": 1580,
      "##kur": 1581,
      "##edul": 1582,
      "##alm": 1583,
      "any": 1584,
      "##ural": 1585,
      "##isa": 1586,
      "forec": 1587,
      "stre": 1588,
      "incap": 1589,
      "att": 1590,
      "enter": 1591,
      "place": 1592,
      "##ocomp": 1593,
      "chie": 1594,
      "priv": 1595,
      "organ": 1596,
      "##istration": 1597,
      "sold": 1598,
      "recent": 1599,
      "delivered": 1600,
      "public": 1601,
      "started": 1602,
      "effici": 1603,
      "funds": 1604,
      "devices": 1605,
      "insurance": 1606,
      "schedul": 1607,
      "friday": 1608,
      "lemmink": 1609,
      "environment": 1610,
      "benef": 1611,
      "future": 1612,
      "aspocomp": 1613,
      "wednes": 1614,
      "chief": 1615,
      "wednesday": 1616,
      "33": 1617,
      "ge": 1618,
      "id": 1619,
      "mr": 1620,
      "par": 1621,
      "squ": 1622,
      "tre": 1623,
      "tek": 1624,
      "ve": 1625,
      "##com": 1626,
      "##ted": 1627,
      "##ht": 1628,
      "init": 1629,
      "##row": 1630,
      "ant": 1631,
      "##urement": 1632,
      "##ises": 1633,
      "##ick": 1634,
      "##eld": 1635,
      "conn": 1636,
      "saving": 1637,
      "margin": 1638,
      "perform": 1639,
      "play": 1640,
      "##veral": 1641,
      "areas": 1642,
      "held": 1643,
      "several": 1644,
      "respon": 1645,
      "level": 1646,
      "corporate": 1647,
      "secure": 1648,
      "##ourc": 1649,
      "investments": 1650,
      "december": 1651,
      "stora": 1652,
      "device": 1653,
      "subscrip": 1654,
      "disclosed": 1655,
      "joint": 1656,
      "sanoma": 1657,
      "volume": 1658,
      "members": 1659,
      "tikkur": 1660,
      "estonia": 1661,
      "german": 1662,
      "tonnes": 1663,
      "tecn": 1664,
      "square": 1665,
      "subscript": 1666,
      "tikkurila": 1667,
      "500": 1668,
      "alex": 1669,
      "bn": 1670,
      "base": 1671,
      "call": 1672,
      "dif": 1673,
      "fact": 1674,
      "five": 1675,
      "found": 1676,
      "gain": 1677,
      "half": 1678,
      "jap": 1679,
      "kes": 1680,
      "lic": 1681,
      "sur": 1682,
      "sim": 1683,
      "tak": 1684,
      "wood": 1685,
      "##ting": 1686,
      "##tel": 1687,
      "##ook": 1688,
      "##ne": 1689,
      "stand": 1690,
      "##ung": 1691,
      "being": 1692,
      "##iven": 1693,
      "##ira": 1694,
      "near": 1695,
      "enso": 1696,
      "enabl": 1697,
      "operator": 1698,
      "##plement": 1699,
      "##ability": 1700,
      "using": 1701,
      "seg": 1702,
      "sek": 1703,
      "120": 1704,
      "respect": 1705,
      "250": 1706,
      "investors": 1707,
      "adp": 1708,
      "account": 1709,
      "week": 1710,
      "consult": 1711,
      "implement": 1712,
      "paid": 1713,
      "##ribed": 1714,
      "deliveries": 1715,
      "hands": 1716,
      "scan": 1717,
      "higher": 1718,
      "present": 1719,
      "facilities": 1720,
      "##ixed": 1721,
      "model": 1722,
      "positive": 1723,
      "hold": 1724,
      "amounted": 1725,
      "measures": 1726,
      "received": 1727,
      "cooperation": 1728,
      "france": 1729,
      "affect": 1730,
      "demand": 1731,
      "pulp": 1732,
      "voting": 1733,
      "kemira": 1734,
      "scheduled": 1735,
      "respons": 1736,
      "alexand": 1737,
      "31": 1738,
      "45": 1739,
      "fu": 1740,
      "fixed": 1741,
      "home": 1742,
      "mult": 1743,
      "neste": 1744,
      "ol": 1745,
      "ob": 1746,
      "pot": 1747,
      "pass": 1748,
      "ret": 1749,
      "sel": 1750,
      "sports": 1751,
      "##par": 1752,
      "##rast": 1753,
      "##ior": 1754,
      "##iet": 1755,
      "##kt": 1756,
      "thurs": 1757,
      "##onen": 1758,
      "tool": 1759,
      "##its": 1760,
      "##itut": 1761,
      "##ential": 1762,
      "prot": 1763,
      "compr": 1764,
      "beer": 1765,
      "only": 1766,
      "conver": 1767,
      "saf": 1768,
      "reach": 1769,
      "she": 1770,
      "income": 1771,
      "##imek": 1772,
      "##raz": 1773,
      "marimek": 1774,
      "plat": 1775,
      "maga": 1776,
      "operators": 1777,
      "covers": 1778,
      "change": 1779,
      "chang": 1780,
      "prices": 1781,
      "##ages": 1782,
      "##aces": 1783,
      "upm": 1784,
      "140": 1785,
      "increas": 1786,
      "totalled": 1787,
      "access": 1788,
      "technop": 1789,
      "acquire": 1790,
      "build": 1791,
      "technologies": 1792,
      "bring": 1793,
      "brid": 1794,
      "super": 1795,
      "suomen": 1796,
      "transport": 1797,
      "employs": 1798,
      "##ferent": 1799,
      "turk": 1800,
      "generated": 1801,
      "electronic": 1802,
      "published": 1803,
      "life": 1804,
      "applications": 1805,
      "reduct": 1806,
      "established": 1807,
      "property": 1808,
      "structures": 1809,
      "poland": 1810,
      "logistics": 1811,
      "componenta": 1812,
      "tekla": 1813,
      "savings": 1814,
      "different": 1815,
      "japan": 1816,
      "thursday": 1817,
      "marimekko": 1818,
      "magaz": 1819,
      "36": 1820,
      "39": 1821,
      "aust": 1822,
      "best": 1823,
      "bond": 1824,
      "cir": 1825,
      "clear": 1826,
      "kon": 1827,
      "lith": 1828,
      "ny": 1829,
      "ple": 1830,
      "run": 1831,
      "rad": 1832,
      "si": 1833,
      "set": 1834,
      "tem": 1835,
      "vis": 1836,
      "vers": 1837,
      "very": 1838,
      "##mark": 1839,
      "##pp": 1840,
      "##ou": 1841,
      "##ring": 1842,
      "##sk": 1843,
      "##house": 1844,
      "##organ": 1845,
      "##icip": 1846,
      "##ental": 1847,
      "eur3": 1848,
      "eur2": 1849,
      "ital": 1850,
      "online": 1851,
      "##ishing": 1852,
      "##thing": 1853,
      "need": 1854,
      "##ows": 1855,
      "##ump": 1856,
      "print": 1857,
      "130": 1858,
      "ago": 1859,
      "##aston": 1860,
      "investor": 1861,
      "book": 1862,
      "teleste": 1863,
      "suc": 1864,
      "manager": 1865,
      "managing": 1866,
      "make": 1867,
      "glass": 1868,
      "plants": 1869,
      "owner": 1870,
      "##ramo": 1871,
      "terms": 1872,
      "assets": 1873,
      "working": 1874,
      "continue": 1875,
      "brands": 1876,
      "stores": 1877,
      "telecomm": 1878,
      "espo": 1879,
      "subscribed": 1880,
      "consumers": 1881,
      "application": 1882,
      "entire": 1883,
      "summ": 1884,
      "posted": 1885,
      "situation": 1886,
      "infrast": 1887,
      "combined": 1888,
      "executive": 1889,
      "performance": 1890,
      "##ources": 1891,
      "circ": 1892,
      "lithuan": 1893,
      "infrastruct": 1894,
      "but": 1895,
      "big": 1896,
      "cal": 1897,
      "den": 1898,
      "date": 1899,
      "har": 1900,
      "if": 1901,
      "lond": 1902,
      "lik": 1903,
      "nas": 1904,
      "sk": 1905,
      "test": 1906,
      "ut": 1907,
      "way": 1908,
      "æn": 1909,
      "##min": 1910,
      "##met": 1911,
      "##uc": 1912,
      "##iation": 1913,
      "##led": 1914,
      "##gic": 1915,
      "##bo": 1916,
      "##ann": 1917,
      "inn": 1918,
      "##arily": 1919,
      "##omin": 1920,
      "##elt": 1921,
      "##ety": 1922,
      "##ideo": 1923,
      "##ecranes": 1924,
      "cond": 1925,
      "ald": 1926,
      "##abor": 1927,
      "##rang": 1928,
      "upon": 1929,
      "resources": 1930,
      "india": 1931,
      "expans": 1932,
      "170": 1933,
      "offers": 1934,
      "offering": 1935,
      "270": 1936,
      "##ption": 1937,
      "##ically": 1938,
      "record": 1939,
      "provided": 1940,
      "glaston": 1941,
      "##ibility": 1942,
      "divest": 1943,
      "decision": 1944,
      "delivery": 1945,
      "##ize": 1946,
      "##ization": 1947,
      "electric": 1948,
      "##ught": 1949,
      "##holm": 1950,
      "processing": 1951,
      "arrang": 1952,
      "institut": 1953,
      "internet": 1954,
      "european": 1955,
      "strategic": 1956,
      "fully": 1957,
      "fourth": 1958,
      "cargo": 1959,
      "improved": 1960,
      "small": 1961,
      "##daq": 1962,
      "digital": 1963,
      "taxes": 1964,
      "installation": 1965,
      "ebit": 1966,
      "packaging": 1967,
      "experience": 1968,
      "stream": 1969,
      "private": 1970,
      "lemminkainen": 1971,
      "treat": 1972,
      "kesko": 1973,
      "respectively": 1974,
      "alexandria": 1975,
      "bridge": 1976,
      "konecranes": 1977,
      "tempor": 1978,
      "espoo": 1979,
      "infrastructure": 1980,
      "london": 1981,
      "nasdaq": 1982,
      "expansion": 1983,
      "28": 1984,
      "32": 1985,
      "300": 1986,
      "bi": 1987,
      "bl": 1988,
      "braz": 1989,
      "cramo": 1990,
      "did": 1991,
      "ever": 1992,
      "flex": 1993,
      "hu": 1994,
      "hon": 1995,
      "hot": 1996,
      "house": 1997,
      "lines": 1998,
      "nar": 1999,
      "nat": 2000,
      "ok": 2001,
      "pip": 2002,
      "ram": 2003,
      "sq": 2004,
      "sat": 2005,
      "site": 2006,
      "tam": 2007,
      "tall": 2008,
      "vent": 2009,
      "video": 2010,
      "##mm": 2011,
      "##med": 2012,
      "##aja": 2013,
      "##aara": 2014,
      "##co": 2015,
      "##uch": 2016,
      "##uce": 2017,
      "##ients": 2018,
      "##view": 2019,
      "##son": 2020,
      "##hor": 2021,
      "##go": 2022,
      "##gest": 2023,
      "##band": 2024,
      "##ful": 2025,
      "##ern": 2026,
      "##ants": 2027,
      "##arts": 2028,
      "##ale": 2029,
      "##ided": 2030,
      "##olis": 2031,
      "sto": 2032,
      "states": 2033,
      "##emical": 2034,
      "asia": 2035,
      "aspo": 2036,
      "export": 2037,
      "maxim": 2038,
      "operates": 2039,
      "##ably": 2040,
      "chemical": 2041,
      "##artment": 2042,
      "usa": 2043,
      "##okump": 2044,
      "##ounts": 2045,
      "index": 2046,
      "160": 2047,
      "bought": 2048,
      "##ify": 2049,
      "240": 2050,
      "adv": 2051,
      "admin": 2052,
      "developer": 2053,
      "spond": 2054,
      "outotec": 2055,
      "outokump": 2056,
      "##ension": 2057,
      "##ensive": 2058,
      "industries": 2059,
      "manufacture": 2060,
      "import": 2061,
      "makes": 2062,
      "close": 2063,
      "planning": 2064,
      "included": 2065,
      "afx": 2066,
      "decided": 2067,
      "large": 2068,
      "##ences": 2069,
      "assoc": 2070,
      "##ahto": 2071,
      "complete": 2072,
      "author": 2073,
      "358": 2074,
      "vaahto": 2075,
      "partner": 2076,
      "remaining": 2077,
      "patent": 2078,
      "properties": 2079,
      "trading": 2080,
      "activities": 2081,
      "become": 2082,
      "liters": 2083,
      "automation": 2084,
      "listed": 2085,
      "register": 2086,
      "beginning": 2087,
      "broadband": 2088,
      "recently": 2089,
      "initi": 2090,
      "connect": 2091,
      "germany": 2092,
      "potential": 2093,
      "aldata": 2094,
      "brazil": 2095,
      "maximum": 2096,
      "sponda": 2097,
      "outokumpu": 2098,
      "38": 2099,
      "44": 2100,
      "42": 2101,
      "49": 2102,
      "400": 2103,
      "bid": 2104,
      "bio": 2105,
      "back": 2106,
      "cz": 2107,
      "col": 2108,
      "er": 2109,
      "each": 2110,
      "econ": 2111,
      "fav": 2112,
      "fair": 2113,
      "gas": 2114,
      "hy": 2115,
      "his": 2116,
      "mech": 2117,
      "nav": 2118,
      "pain": 2119,
      "soc": 2120,
      "yester": 2121,
      "you": 2122,
      "##cement": 2123,
      "##vo": 2124,
      "##ves": 2125,
      "##wer": 2126,
      "##yc": 2127,
      "##hod": 2128,
      "##get": 2129,
      "##bt": 2130,
      "##ky": 2131,
      "##fol": 2132,
      "them": 2133,
      "##aruukki": 2134,
      "##ending": 2135,
      "##ists": 2136,
      "##etax": 2137,
      "fort": 2138,
      "##olid": 2139,
      "stud": 2140,
      "##irent": 2141,
      "read": 2142,
      "reports": 2143,
      "##oski": 2144,
      "##ulu": 2145,
      "alt": 2146,
      "operational": 2147,
      "##apers": 2148,
      "prim": 2149,
      "pretax": 2150,
      "users": 2151,
      "190": 2152,
      "businesses": 2153,
      "upgr": 2154,
      "##ards": 2155,
      "above": 2156,
      "offic": 2157,
      "##thern": 2158,
      "developing": 2159,
      "meat": 2160,
      "##ostaja": 2161,
      "syn": 2162,
      "consid": 2163,
      "consolid": 2164,
      "making": 2165,
      "##mann": 2166,
      "approved": 2167,
      "stockholm": 2168,
      "stockmann": 2169,
      "location": 2170,
      "located": 2171,
      "generation": 2172,
      "##unications": 2173,
      "continued": 2174,
      "options": 2175,
      "loan": 2176,
      "look": 2177,
      "persons": 2178,
      "portfol": 2179,
      "aims": 2180,
      "consumer": 2181,
      "partners": 2182,
      "talv": 2183,
      "mainly": 2184,
      "structure": 2185,
      "digia": 2186,
      "carried": 2187,
      "function": 2188,
      "kymm": 2189,
      "whole": 2190,
      "producer": 2191,
      "rautaruukki": 2192,
      "representing": 2193,
      "liqu": 2194,
      "panostaja": 2195,
      "charging": 2196,
      "environmental": 2197,
      "benefon": 2198,
      "factory": 2199,
      "enables": 2200,
      "handset": 2201,
      "passeng": 2202,
      "increasing": 2203,
      "technopolis": 2204,
      "magazine": 2205,
      "nyse": 2206,
      "telecommunications": 2207,
      "innov": 2208,
      "treatment": 2209,
      "narrow": 2210,
      "natural": 2211,
      "ramirent": 2212,
      "venture": 2213,
      "administration": 2214,
      "czech": 2215,
      "econom": 2216,
      "mechan": 2217,
      "social": 2218,
      "yesterday": 2219,
      "portfolio": 2220,
      "kymmene": 2221,
      "3g": 2222,
      "56": 2223,
      "65": 2224,
      "75": 2225,
      "cam": 2226,
      "came": 2227,
      "cert": 2228,
      "job": 2229,
      "kone": 2230,
      "lower": 2231,
      "mic": 2232,
      "mov": 2233,
      "move": 2234,
      "much": 2235,
      "name": 2236,
      "rise": 2237,
      "right": 2238,
      "sil": 2239,
      "vac": 2240,
      "wel": 2241,
      "wir": 2242,
      "ware": 2243,
      "wind": 2244,
      "##mend": 2245,
      "##aff": 2246,
      "##can": 2247,
      "##ty": 2248,
      "##oor": 2249,
      "##other": 2250,
      "##ii": 2251,
      "##side": 2252,
      "##les": 2253,
      "##hit": 2254,
      "##by": 2255,
      "##bor": 2256,
      "##dance": 2257,
      "##ke": 2258,
      "##atch": 2259,
      "##atives": 2260,
      "another": 2261,
      "##ured": 2262,
      ",\"(": 2263,
      "##asts": 2264,
      "##isio": 2265,
      "##isala": 2266,
      "##eless": 2267,
      "forward": 2268,
      "final": 2269,
      "##emens": 2270,
      "##ivers": 2271,
      "##ivaara": 2272,
      "conf": 2273,
      "requ": 2274,
      "within": 2275,
      "exist": 2276,
      "alm": 2277,
      "finnair": 2278,
      "atria": 2279,
      "##umb": 2280,
      "who": 2281,
      "##verage": 2282,
      "content": 2283,
      "contain": 2284,
      "cour": 2285,
      "core": 2286,
      "##atings": 2287,
      "110": 2288,
      "230": 2289,
      "220": 2290,
      "210": 2291,
      "''\"": 2292,
      "spring": 2293,
      "particip": 2294,
      "intend": 2295,
      "financing": 2296,
      "##ource": 2297,
      "metres": 2298,
      "method": 2299,
      "phones": 2300,
      "accordance": 2301,
      "clo": 2302,
      "planned": 2303,
      "##ublic": 2304,
      "raw": 2305,
      "raisio": 2306,
      "equity": 2307,
      "afric": 2308,
      "prem": 2309,
      "actual": 2310,
      "announcement": 2311,
      "estimates": 2312,
      "elisa": 2313,
      "art": 2314,
      "vaisala": 2315,
      "republic": 2316,
      "machines": 2317,
      "team": 2318,
      "shareholder": 2319,
      "measurement": 2320,
      "communication": 2321,
      "costs": 2322,
      "##ission": 2323,
      "latest": 2324,
      "statements": 2325,
      "know": 2326,
      "known": 2327,
      "previously": 2328,
      "road": 2329,
      "##astern": 2330,
      "shopping": 2331,
      "rapala": 2332,
      "forecasts": 2333,
      "licens": 2334,
      "segment": 2335,
      "responsible": 2336,
      "olvi": 2337,
      "select": 2338,
      "platform": 2339,
      "siemens": 2340,
      "circuit": 2341,
      "##metic": 2342,
      "electricity": 2343,
      "okmetic": 2344,
      "biohit": 2345,
      "talvivaara": 2346,
      "liquid": 2347,
      "micro": 2348,
      "37": 2349,
      "43": 2350,
      "41": 2351,
      "51": 2352,
      "akt": 2353,
      "bran": 2354,
      "dom": 2355,
      "dis": 2356,
      "dans": 2357,
      "fre": 2358,
      "gra": 2359,
      "hist": 2360,
      "hks": 2361,
      "il": 2362,
      "jy": 2363,
      "just": 2364,
      "mor": 2365,
      "mos": 2366,
      "mot": 2367,
      "national": 2368,
      "os": 2369,
      "old": 2370,
      "oulu": 2371,
      "pons": 2372,
      "ren": 2373,
      "rental": 2374,
      "sing": 2375,
      "sust": 2376,
      "ten": 2377,
      "tap": 2378,
      "tues": 2379,
      "vene": 2380,
      "went": 2381,
      "##mb": 2382,
